Exploring some more pandas functionality
-----------------------------------------

* apply()

In [2]:
import pandas as pd

df = pd.DataFrame({ 'x': [1,2,-1], 'y': [-2, 6, 4], 'z': [1,2,3]})
df

   x  y  z
0  1 -2  1
1  2  6  2
2 -1  4  3

In [5]:
# understanding lambda functions
increment = lambda a: a+1
print(increment(10))

simple_intrest = lambda p, t, r: p * t * r /100

print(simple_intrest(10000, 2, 12))

df['x_squared'] = df['x'].apply(lambda a: a**2)
df

11
2400.0

   x  y  z  x_squared
0  1 -2  1          1
1  2  6  2          4
2 -1  4  3          1

In [6]:
def parity_str(x):
    if x % 2 == 0:
        return 'even'
    return 'odd'

df['x_parity'] = df['x'].apply(parity_str)
df

   x  y  z  x_squared x_parity
0  1 -2  1          1      odd
1  2  6  2          4     even
2 -1  4  3          1      odd

### get_dummies 
* This function implements a technique called as one-hot encoding

In [7]:
df['x_parity']

0     odd
1    even
2     odd
Name: x_parity, dtype: object

In [8]:
pd.get_dummies(df['x_parity'])

   even  odd
0     0    1
1     1    0
2     0    1

### value_counts

In [9]:
df['x_parity'].value_counts()

odd     2
even    1
Name: x_parity, dtype: int64

Students Data Set
-------------------

In [10]:
students_df = pd.read_csv('students.csv')
students_df

      name  gender  class  gpa  num_classes
0   Jyothi  female  Btech   90            3
1    Mohit    male  Mtech   93            1
2     Naga    male  Btech   85            3
3    Navya  female  Mtech   87            2
4     Ramu    male  Mtech   95            3
5    Satya    male  Btech   92            2
6  Shivani  female    Bsc   97            3
7    umend    male  Btech   81            2
8   vamshi    male  Btech   85            2
9       vv    male  Btech   82            2

In [11]:
students_df['female_flag'] = students_df['gender'].apply(lambda g: g =='female')
students_df

      name  gender  class  gpa  num_classes  female_flag
0   Jyothi  female  Btech   90            3         True
1    Mohit    male  Mtech   93            1        False
2     Naga    male  Btech   85            3        False
3    Navya  female  Mtech   87            2         True
4     Ramu    male  Mtech   95            3        False
5    Satya    male  Btech   92            2        False
6  Shivani  female    Bsc   97            3         True
7    umend    male  Btech   81            2        False
8   vamshi    male  Btech   85            2        False
9       vv    male  Btech   82            2        False

In [12]:
# group_by
gender_group = students_df.groupby('female_flag')
gender_group

In [13]:
gender_group['gpa'].mean()

female_flag
False    87.571429
True     91.333333
Name: gpa, dtype: float64

In [14]:
gender_group['gpa'].median()

female_flag
False    85.0
True     90.0
Name: gpa, dtype: float64

In [15]:
class_group = students_df.groupby('class')
class_group['gpa'].mean()

class
Bsc      97.000000
Btech    85.833333
Mtech    91.666667
Name: gpa, dtype: float64